# Pandas

Pandas is an powerful Python module for data analysis. It provides a new data structure called a "dataframe". This is similar to the data.frame structure in R and can be treated almost like an in-memory database.

## Import modules

In [1]:
import pandas as pd
import numpy as np

# Series and Dataframes

Pandas actually has two data structures, Series and Dataframes. A Dataframe is a two dimensional data structure. It is comprised of rows and columns of data. A Series is the data structure for a single column of a dataframe. Certain pandas operations will return a Series as a standalone data structure.

Both data structures also have an 'index' which uniquely identifies each row. By default, Pandas will assign an integer id as the index, however you can override this and set a column of your choosing as the index (does not have to be an integer) as long as all values in that column are unique.

## Series

Series can only ever have 1 column (plus an index).

In [2]:
data = np.random.rand(5)
pd.Series(data)

0    0.771664
1    0.731986
2    0.778630
3    0.038124
4    0.443947
dtype: float64

In [3]:
pd.Series(data, index = ['Astronomy', 'Geology', 'Economics', 'English', 'History'])

Astronomy    0.771664
Geology      0.731986
Economics    0.778630
English      0.038124
History      0.443947
dtype: float64

## Dataframe

In [4]:
pd.DataFrame(data, columns = ['Score'], index = ['Astronomy', 'Geology', 'Economics', 'English', 'History'])

              Score
Astronomy  0.771664
Geology    0.731986
Economics  0.778630
English    0.038124
History    0.443947

# How to Create a Dataframe

There are numerous ways to create a Dataframe, including reading directly from a database.

## Create DataFrame from Numpy Array

In [5]:
planets_data = np.array([[0.330, 4879, 3.7, 88.0],
            [4.87, 12104, 8.9, 224.7],
            [5.97, 12756, 9.8, 365.2 ],
            [0.642, 6792, 3.7, 687.0],
            [1898, 142984, 23.1, 4331],
            [568, 120536, 9.0, 10747],
            [86.8, 51118, 8.7, 30589],
            [102, 49528, 11.0, 59800]])
planets_data

array([[  3.30000000e-01,   4.87900000e+03,   3.70000000e+00,
          8.80000000e+01],
       [  4.87000000e+00,   1.21040000e+04,   8.90000000e+00,
          2.24700000e+02],
       [  5.97000000e+00,   1.27560000e+04,   9.80000000e+00,
          3.65200000e+02],
       [  6.42000000e-01,   6.79200000e+03,   3.70000000e+00,
          6.87000000e+02],
       [  1.89800000e+03,   1.42984000e+05,   2.31000000e+01,
          4.33100000e+03],
       [  5.68000000e+02,   1.20536000e+05,   9.00000000e+00,
          1.07470000e+04],
       [  8.68000000e+01,   5.11180000e+04,   8.70000000e+00,
          3.05890000e+04],
       [  1.02000000e+02,   4.95280000e+04,   1.10000000e+01,
          5.98000000e+04]])

In [6]:
planets = pd.DataFrame(planets_data, 
                  columns=['mass', 'diameter', 'gravity', 'period'],
                  index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn','Uranus','Neptune'])
planets

             mass  diameter  gravity   period
Mercury     0.330    4879.0      3.7     88.0
Venus       4.870   12104.0      8.9    224.7
Earth       5.970   12756.0      9.8    365.2
Mars        0.642    6792.0      3.7    687.0
Jupiter  1898.000  142984.0     23.1   4331.0
Saturn    568.000  120536.0      9.0  10747.0
Uranus     86.800   51118.0      8.7  30589.0
Neptune   102.000   49528.0     11.0  59800.0

## Create DataFrame from List of Tuples (or Lists)

In [7]:
names = ['Ceres', 'Pluto', 'Haumea', 'Makemake', 'Eris']
distance = [2.77, 39.26, 43.13, 45.79, 68.01] #in AU
dwarf_planets = list(zip(names, distance))
dwarf_planets

[('Ceres', 2.77),
 ('Pluto', 39.26),
 ('Haumea', 43.13),
 ('Makemake', 45.79),
 ('Eris', 68.01)]

In [8]:
dp = pd.DataFrame(data=dwarf_planets, columns=['name', 'distance'])
dp.set_index('name')
dp

       name  distance
0     Ceres      2.77
1     Pluto     39.26
2    Haumea     43.13
3  Makemake     45.79
4      Eris     68.01

## Creating Data Frame from dictionary

In [9]:
moons = pd.DataFrame({'diameter':[4821, 5262, 3122, 3643],
                  'mass':[107.6, 148.2, 48.0, 89.3]},
                   index=['Callisto','Ganymede','Europa','Io'])
moons

          diameter   mass
Callisto      4821  107.6
Ganymede      5262  148.2
Europa        3122   48.0
Io            3643   89.3

## Read Data from a CSV

In [10]:
solar_system = pd.read_csv('solar_system_abbr.csv', index_col=0)
solar_system

                        Type  Order from Sun   Diameter          Mass
Name
Sun                     Star               0  1392000.0  333000.00000
Mercury   Terrestrial planet               1     4878.0       0.05500
Venus     Terrestrial planet               2    12104.0       0.81500
Earth     Terrestrial planet               3    12756.0       1.00000
Mars      Terrestrial planet               4     6787.0       0.10700
Jupiter            Gas giant               6   142800.0     318.00000
Saturn             Gas giant               7   120000.0      95.00000
Uranus             Gas giant               8    51118.0      15.00000
Neptune            Gas giant               9    49528.0      17.00000
Ceres           Dwarf planet               5      974.6       0.00016
Pluto           Dwarf planet              10     2300.0       0.00200
Haumea          Dwarf planet              11     1300.0       0.00070
Makemake        Dwarf planet              12     1420.0       0.00067
Eris            Dwarf planet              13     2326.0       0.00280

## Get information about Data Frame

In [11]:
solar_system.shape

(14, 4)

In [12]:
solar_system.dtypes

Type               object
Order from Sun      int64
Diameter          float64
Mass              float64
dtype: object

In [13]:
solar_system.describe()

       Order from Sun      Diameter           Mass
count         14.0000  1.400000e+01      14.000000
mean           6.5000  1.285923e+05   23817.641666
std            4.1833  3.665235e+05   88988.845412
min            0.0000  9.746000e+02       0.000160
25%            3.2500  2.306500e+03       0.002200
50%            6.5000  9.445500e+03       0.461000
75%            9.7500  5.072050e+04      16.500000
max           13.0000  1.392000e+06  333000.000000

## Accessing data in Dataframes

There are multiple ways to access data in dataframes. Each method has its own strengths for different use cases.

## `.iloc[x,y]`

Use `iloc` to access data based on its location in the dataframe. This is the most similar method to access data in a list or numpy array.

In [14]:
# Get element 5,2
planets.iloc[5,2]

9.0

In [15]:
# Get column 0
planets.iloc[:,0]

Mercury       0.330
Venus         4.870
Earth         5.970
Mars          0.642
Jupiter    1898.000
Saturn      568.000
Uranus       86.800
Neptune     102.000
Name: mass, dtype: float64

In [16]:
# Get columns 0 thru 2
planets.iloc[:,0:3]

             mass  diameter  gravity
Mercury     0.330    4879.0      3.7
Venus       4.870   12104.0      8.9
Earth       5.970   12756.0      9.8
Mars        0.642    6792.0      3.7
Jupiter  1898.000  142984.0     23.1
Saturn    568.000  120536.0      9.0
Uranus     86.800   51118.0      8.7
Neptune   102.000   49528.0     11.0

In [17]:
# Get row 0
planets.iloc[4,:]

mass          1898.0
diameter    142984.0
gravity         23.1
period        4331.0
Name: Jupiter, dtype: float64

In [18]:
# Get rows 2 thru 6
planets.iloc[2:6,:]

             mass  diameter  gravity   period
Earth       5.970   12756.0      9.8    365.2
Mars        0.642    6792.0      3.7    687.0
Jupiter  1898.000  142984.0     23.1   4331.0
Saturn    568.000  120536.0      9.0  10747.0

In [19]:
# Get rows 0 and 2
planets.iloc[[0,2],:]

         mass  diameter  gravity  period
Mercury  0.33    4879.0      3.7    88.0
Earth    5.97   12756.0      9.8   365.2

## .loc[x,y]

Use `loc` to access data based on the labels in the dataframe. This is often a more natural way to reference certain types of tabular data, such as when both the rows and columns are have meaningful labels.

In [20]:
planets.loc['Saturn','mass']

568.0

In [21]:
planets.loc[:,'mass':'gravity']

             mass  diameter  gravity
Mercury     0.330    4879.0      3.7
Venus       4.870   12104.0      8.9
Earth       5.970   12756.0      9.8
Mars        0.642    6792.0      3.7
Jupiter  1898.000  142984.0     23.1
Saturn    568.000  120536.0      9.0
Uranus     86.800   51118.0      8.7
Neptune   102.000   49528.0     11.0

In [22]:
planets['mass']

Mercury       0.330
Venus         4.870
Earth         5.970
Mars          0.642
Jupiter    1898.000
Saturn      568.000
Uranus       86.800
Neptune     102.000
Name: mass, dtype: float64

In [23]:
planets.loc[:,['mass','period']]

             mass   period
Mercury     0.330     88.0
Venus       4.870    224.7
Earth       5.970    365.2
Mars        0.642    687.0
Jupiter  1898.000   4331.0
Saturn    568.000  10747.0
Uranus     86.800  30589.0
Neptune   102.000  59800.0

In [24]:
planets.loc['Jupiter',:]

mass          1898.0
diameter    142984.0
gravity         23.1
period        4331.0
Name: Jupiter, dtype: float64

In [25]:
planets.loc['Earth':'Saturn',:]

             mass  diameter  gravity   period
Earth       5.970   12756.0      9.8    365.2
Mars        0.642    6792.0      3.7    687.0
Jupiter  1898.000  142984.0     23.1   4331.0
Saturn    568.000  120536.0      9.0  10747.0

In [26]:
planets.loc[['Mercury','Earth'],:]

         mass  diameter  gravity  period
Mercury  0.33    4879.0      3.7    88.0
Earth    5.97   12756.0      9.8   365.2

## Modifying data in Data Frames

Individual elements or slices in a dataframe can be modified using the above access methods.

In [27]:
m = np.random.rand(5,3)
df = pd.DataFrame(m, 
                  columns=['a', 'b', 'c'],
                  index=['A','B','C','D','E'])

# Set element 0, 0
df.iloc[2,1] = 100.0
df.iloc[2,1]

100.0

In [28]:
df.loc['A','a'] = 200.0
df.iloc[0,0]

200.0

In [29]:
# Set column 0 using 1D-array
df.iloc[:,0] = np.arange(5, dtype=np.float64)
df

     a           b         c
A  0.0    0.712986  0.283673
B  1.0    0.332245  0.016079
C  2.0  100.000000  0.445675
D  3.0    0.612177  0.793030
E  4.0    0.038487  0.883765

In [30]:
# Set column 1 using scalar
df.iloc[:,1] = 200.0
df

     a      b         c
A  0.0  200.0  0.283673
B  1.0  200.0  0.016079
C  2.0  200.0  0.445675
D  3.0  200.0  0.793030
E  4.0  200.0  0.883765

# Math with Dataframes

You can do math using whole. columns and rows of data frames, similar to numpy.

In [31]:
import math
(4/3)*math.pi*(moons['diameter']/2)**3

Callisto    4.400188e+10
Ganymede    5.721533e+10
Europa      1.194974e+10
Io          1.898617e+10
Name: diameter, dtype: float64

You can even add a new column to the dataframe with the derived quantity

In [32]:
moons['volume'] = (4/3)*math.pi*(moons['diameter']/2)**3
moons

          diameter   mass        volume
Callisto      4821  107.6  4.400188e+10
Ganymede      5262  148.2  5.721533e+10
Europa        3122   48.0  1.194974e+10
Io            3643   89.3  1.898617e+10

You can do also math using two or more columns to derive a new column.

In [33]:
moons['density'] = moons['mass']/moons['volume']
moons

          diameter   mass        volume       density
Callisto      4821  107.6  4.400188e+10  2.445350e-09
Ganymede      5262  148.2  5.721533e+10  2.590215e-09
Europa        3122   48.0  1.194974e+10  4.016823e-09
Io            3643   89.3  1.898617e+10  4.703423e-09

# Grouping data and Aggregation

One of the most powerful uses for dataframes is to reorganize your data into groups and perform data aggregations.

In [34]:
bodies_by_type = solar_system.groupby('Type')
bodies_by_type

When you call groupby(), it creates a 'GroupBy' objects. At this stage, no actual computation has been performed yet to 'split' your data. The successful create of the objects is just a validation of the groupby operation you have requested.

You can access each of the groups by name to see what is in them

In [35]:
bodies_by_type.get_group('Gas giant')

              Type  Order from Sun  Diameter   Mass
Name
Jupiter  Gas giant               6  142800.0  318.0
Saturn   Gas giant               7  120000.0   95.0
Uranus   Gas giant               8   51118.0   15.0
Neptune  Gas giant               9   49528.0   17.0

We can perform some aggregations, such as sum, median or mean.

In [36]:
bodies_by_type.sum()

                    Order from Sun   Diameter          Mass
Type
Dwarf planet                    51     8320.6       0.00633
Gas giant                       30   363446.0     445.00000
Star                             0  1392000.0  333000.00000
Terrestrial planet              10    36525.0       1.97700

You can use tab completion to see all the aggregation methods available.

In [37]:
bodies_by_type.max()

                    Order from Sun   Diameter         Mass
Type
Dwarf planet                    13     2326.0       0.0028
Gas giant                        9   142800.0     318.0000
Star                             0  1392000.0  333000.0000
Terrestrial planet               4    12756.0       1.0000

# Filtering a Dataframe

Data in dataframes can also be filtered using boolean operations.

In [38]:
solar_system[solar_system['Mass'] > 1.0]

              Type  Order from Sun   Diameter      Mass
Name
Sun           Star               0  1392000.0  333000.0
Jupiter  Gas giant               6   142800.0     318.0
Saturn   Gas giant               7   120000.0      95.0
Uranus   Gas giant               8    51118.0      15.0
Neptune  Gas giant               9    49528.0      17.0

In [39]:
solar_system[solar_system['Type'] == 'Terrestrial planet']

                       Type  Order from Sun  Diameter   Mass
Name
Mercury  Terrestrial planet               1    4878.0  0.055
Venus    Terrestrial planet               2   12104.0  0.815
Earth    Terrestrial planet               3   12756.0  1.000
Mars     Terrestrial planet               4    6787.0  0.107

# Merges, Joins and Concatenation

There are multiple methods to combine dataframes together. I'll highlight a few useful methods here, but I recommend a look at the official pandas documentation for all the possible ways to combine dataframes. 

https://pandas.pydata.org/pandas-docs/stable/merging.html

## A Simple Append

In [40]:
large_bodies = solar_system[solar_system['Type'] != 'Dwarf planet']
small_bodies = solar_system[solar_system['Type'] == 'Dwarf planet'] 
large_bodies

                       Type  Order from Sun   Diameter        Mass
Name
Sun                    Star               0  1392000.0  333000.000
Mercury  Terrestrial planet               1     4878.0       0.055
Venus    Terrestrial planet               2    12104.0       0.815
Earth    Terrestrial planet               3    12756.0       1.000
Mars     Terrestrial planet               4     6787.0       0.107
Jupiter           Gas giant               6   142800.0     318.000
Saturn            Gas giant               7   120000.0      95.000
Uranus            Gas giant               8    51118.0      15.000
Neptune           Gas giant               9    49528.0      17.000

In [41]:
whole_system = large_bodies.append(small_bodies)
whole_system

                        Type  Order from Sun   Diameter          Mass
Name
Sun                     Star               0  1392000.0  333000.00000
Mercury   Terrestrial planet               1     4878.0       0.05500
Venus     Terrestrial planet               2    12104.0       0.81500
Earth     Terrestrial planet               3    12756.0       1.00000
Mars      Terrestrial planet               4     6787.0       0.10700
Jupiter            Gas giant               6   142800.0     318.00000
Saturn             Gas giant               7   120000.0      95.00000
Uranus             Gas giant               8    51118.0      15.00000
Neptune            Gas giant               9    49528.0      17.00000
Ceres           Dwarf planet               5      974.6       0.00016
Pluto           Dwarf planet              10     2300.0       0.00200
Haumea          Dwarf planet              11     1300.0       0.00070
Makemake        Dwarf planet              12     1420.0       0.00067
Eris            Dwarf planet              13     2326.0       0.00280

# Concatenation

`pd.concat` is similar to append, except that the two dataframes don't have to have exactly the same columns. Columns outside the intersection will be filled with NaN values.

In [42]:
pd.concat([planets, moons])

               density  diameter  gravity      mass   period        volume
Mercury            NaN    4879.0      3.7     0.330     88.0           NaN
Venus              NaN   12104.0      8.9     4.870    224.7           NaN
Earth              NaN   12756.0      9.8     5.970    365.2           NaN
Mars               NaN    6792.0      3.7     0.642    687.0           NaN
Jupiter            NaN  142984.0     23.1  1898.000   4331.0           NaN
Saturn             NaN  120536.0      9.0   568.000  10747.0           NaN
Uranus             NaN   51118.0      8.7    86.800  30589.0           NaN
Neptune            NaN   49528.0     11.0   102.000  59800.0           NaN
Callisto  2.445350e-09    4821.0      NaN   107.600      NaN  4.400188e+10
Ganymede  2.590215e-09    5262.0      NaN   148.200      NaN  5.721533e+10
Europa    4.016823e-09    3122.0      NaN    48.000      NaN  1.194974e+10
Io        4.703423e-09    3643.0      NaN    89.300      NaN  1.898617e+10

# Join Dataframes

You can also perform database-like merges and joins of dataframes to add additional columns.

In [43]:
moon_period = pd.DataFrame({'period':[16.68, 7.15, 3.55, 1.76]},
                   index=['Callisto','Ganymede','Europa','Io'])
moon_period

          period
Callisto   16.68
Ganymede    7.15
Europa      3.55
Io          1.76

In [44]:
moons.join(moon_period)

          diameter   mass        volume       density  period
Callisto      4821  107.6  4.400188e+10  2.445350e-09   16.68
Ganymede      5262  148.2  5.721533e+10  2.590215e-09    7.15
Europa        3122   48.0  1.194974e+10  4.016823e-09    3.55
Io            3643   89.3  1.898617e+10  4.703423e-09    1.76

# Pandas with non-numerical data

The examples thus far have been with mostly tabular numerical data, but Pandas Dataframes also are powerful for data analysis of text based data and time series data. Most of the operations (index, grouping, filter, aggregation) are the same with non-numerical data, but I will highlight a few additional features for those types of data.

# Text Based Data

In [45]:
jobs = pd.read_csv('jobs.csv')
jobs

       Id   User   Group    Partition    MPI  Application
0   10001  user1  group2      general   True       RAMSES
1   10002  user1  group2      general   True       Python
2   10003  user2  group1      general   True       Python
3   10004  user1  group2      private  False  SimpleQueue
4   10005  user3  group1      general  False  SimpleQueue
5   10006  user1  group2      general  False  SimpleQueue
6   10007  user4  group3  interactive  False            R
7   10008  user1  group2  interactive  False            R
8   10009  user5  group3      general   True       RAMSES
9   10010  user6  group3      private  False       Matlab
10  10011  user1  group2      private  False       Python
11  10012  user4  group3      general   True       Matlab
12  10013  user1  group2      general  False            R
13  10014  user2  group1      general   True            R

In [46]:
jobs['Application'].value_counts()

R              4
SimpleQueue    3
Python         3
Matlab         2
RAMSES         2
Name: Application, dtype: int64

In [47]:
jobs[jobs['MPI']]['Group'].value_counts()/jobs['Group'].value_counts()

group2    0.285714
group3    0.500000
group1    0.666667
Name: Group, dtype: float64

# Time Series Data

Pandas has a whole set of special features for time series data. I recommend checking out their documentation for a more full description: https://pandas.pydata.org/pandas-docs/stable/timeseries.html

In [48]:
rng = pd.date_range('1/1/2011', periods=72, freq='H')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts.head()

2011-01-01 00:00:00   -0.386940
2011-01-01 01:00:00    0.124884
2011-01-01 02:00:00   -1.332854
2011-01-01 03:00:00   -0.980495
2011-01-01 04:00:00    0.519787
Freq: H, dtype: float64

## Indexing with ranges

In [49]:
ts['1/1/2011 23:00:00':'1/2/2011  4:30:00']

2011-01-01 23:00:00    0.391527
2011-01-02 00:00:00   -0.333546
2011-01-02 01:00:00   -1.278232
2011-01-02 02:00:00    0.171583
2011-01-02 03:00:00   -2.767893
2011-01-02 04:00:00    1.418435
Freq: H, dtype: float64

## Change frequency and fill gaps

In [50]:
# to 45 minute frequency and forward fill
converted = ts.asfreq('45Min', method='pad')
converted.head()

2011-01-01 00:00:00   -0.386940
2011-01-01 00:45:00   -0.386940
2011-01-01 01:30:00    0.124884
2011-01-01 02:15:00   -1.332854
2011-01-01 03:00:00   -0.980495
Freq: 45T, dtype: float64

All these operations can also be performed using timestamps (i.e. also include a time of day), period of time and epochs.

# Interesting Caveats about Dataframes

## Data is shared between Data Frame and ND-array

In [51]:
m = np.random.rand(5,3)
df = pd.DataFrame(m, 
                  columns=['a', 'b', 'c'],
                  index=['A','B','C','D','E'])
df

          a         b         c
A  0.699746  0.342727  0.376917
B  0.671467  0.270661  0.536337
C  0.136077  0.741803  0.971883
D  0.080890  0.657607  0.623919
E  0.875779  0.424093  0.502170

In [52]:
m[0,0] = 10.0
df

           a         b         c
A  10.000000  0.342727  0.376917
B   0.671467  0.270661  0.536337
C   0.136077  0.741803  0.971883
D   0.080890  0.657607  0.623919
E   0.875779  0.424093  0.502170

## Some methods create new Data Frames

In [53]:
# add new column
df = df.assign(d=np.abs(df['c']))

In [54]:
# df has not changed
df

           a         b         c         d
A  10.000000  0.342727  0.376917  0.376917
B   0.671467  0.270661  0.536337  0.536337
C   0.136077  0.741803  0.971883  0.971883
D   0.080890  0.657607  0.623919  0.623919
E   0.875779  0.424093  0.502170  0.502170